
function ABtest(){
  var random = Math.floor( Math.random() * 13 );
console.log(random);
 if(random==0){
   idid = 70;
  $(".dislike").html('東野さんの性格はA?B?<br>');
  answer = 1;
  $(".AA").html('<div class="r"><p>プライドが高いが、それを表面に出さないので、謙虚で穏やかな人という印象を与える。</br>また、優雅で清潔な感じも持ち合わせている。</br>警戒心が強いので、あまり自分の感情を表に出さない。</br>相手の言い分をおとなしく聞くが、実は内心では自分の方が正しいと思っている。</br>身内や親しい人には厳しくするのが愛情だと思っているので、適当なところで妥協したりしない。</br>新しい環境になかなかなじめず、最初は受身で接しているが、次第に自己主張をはじめ、リーダーシップを発揮するようになる。</br>しかし、純真なので野心はない。</br></p>');
  $(".BB").html('<div class="r"><p>細かいことには無頓着で、明るくのびのびとした性格の人です。</br>     面倒見が良いということは良い点であるのですが、頼まれると断れないというお人よしの一面も。</br>          強い信念と高いプライドの持ち主なので、負けず嫌いで常にリードしたいタイプ。</br>     物事に白黒つけたり、即断するのは苦手。</br>          芸術的なセンスに長けていて、独自のセンスや発想を生かすことのできる仕事が天職。</br></p>');

}if(random==1){
  idid = 93;
  $(".dislike").html('宮本さんの性格はA?B?<br>');
  answer = 1;
  $(".AA").html('<div class="r"><p>物腰が柔らかく奥ゆかしい気品のあふれる人。</br>雑学などの知識が豊富なので、話題が次々と出てきて、人との関係を築くことが上手。</br>助け合いの精神を大切にし、和を乱す人が嫌い。</br>社会常識を持っているので、世間からはみ出さないようにふるまっている。</br>才能豊かで完璧を目指すが、柔軟性も持ち合わせているので上手にバランスを取ることができている。</br>自分の思い通りにならないとイライラすることもあるが、周囲に気を遣うこともできる人なので、その点を気をつけていれば人間関係をうまく築くことができるでしょう。</br></p>');
  $(".BB").html('<div class="r"><p>近寄りがたさを感じさせる反面、気安さも感じさせる不思議な雰囲気を持っている人。</br>感受性が豊かで、想像力に富んだ強烈な個性の持ち主。</br>普段は明るく活発だが、気分にむらが多いところがある。</br>また、神経質で飽きっぽいところがあるので、長続きしないことが多い。</br>しかし、社交面での失敗は少ない方。</br>相手を気づかうことができ、意識的におおらかな態度で接することができるからでしょう。</br>物事をとことん突っ込んで分析し、先読みする力に優れているが、最後の詰めは甘いところがウィークポイント。</br>幅広い知識とひらめき力をいかして、素晴らしい力を発揮するタイプと、横道にそれてしまうタイプに2分される。</br></p>');

};
if(random==2){
  idid = 57;
  $(".dislike").html('佐藤さんの性格はA?B?<br>');
  answer = 2;
  $(".AA").html('<div class="r"><p>ワイルドで野生的な雰囲気を持っています。</br>落ち着きがあるので、とっつきにくい印象を与えるが、気を許した相手にはざっくばらんに接する人。</br>情熱家で理想を追い求める傾向があるが、波風を立てるのは嫌い。</br>相手の出方によって自分の対応を決める、臨機応変なタイプ。</br>人脈が豊富で、細かい配慮ができるので、リーダーに向いている。</br>しかし、束縛されることが嫌いなので、他人と協調してやるより個人プレーの方が得意。</br>決められたことをきちんと守るのが苦手なところがあるので注意。</br>物事を行う時、プロセスを大事にする人で、完成するまではしっかり取り組むが、いざ出来上がったものには興味はなくなる。</br></p>');
  $(".BB").html('<div class="r"><p>礼儀正しく、落ち着いた印象を持った人です。</br>物事を冷静に考え、軽はずみな行動をしないので、ミスも少ない。</br>口数が少ないのでクールな感じに見えるようですが、人のためにつくすことができるので、周りからの信頼も自然と集まってくることでしょう。</br>自己中心的な面があり、自分の思い通りにならないと怒りだしてしまうことも。</br>その短気なところが、仕事やプライベートで障害になる可能性があるので注意です。</br></p>');

};
if(random==3){
    idid = 89;
  $(".dislike").html('杉本さんの性格はA?B?<br>');
  answer = 2;
  $(".AA").html('<div class="r"><p>細かいことには無頓着で、明るくのびのびとした性格の人です。</br>面倒見が良いということは良い点であるのですが、頼まれると断れないというお人よしの一面も。</br>強い信念と高いプライドの持ち主なので、負けず嫌いで常にリードしたいタイプ。</br>物事に白黒つけたり、即断するのは苦手。</br>芸術的なセンスに長けていて、独自のセンスや発想を生かすことのできる仕事が天職。</br></p>');
  $(".BB").html('<div class="r"><p>決して弱音をはかない強さがあり、自分にも他人にも厳しい人。</br>一見社交家に見えるが、本来の姿は孤独を恐れず、自分の運命は自分で切り開く独立心の持ち主。</br>負けず嫌いで忍耐強いので、まわりの助けをあてにせず、自分の面倒は自分で見るという強い気持ちがあります。</br>教え方は厳しいものの、相手の細かいところまで気が付くので、指導力は抜群。</br>厳しさに耐えられる相手だったら、素晴らしい師弟関係を結べるはず。</br></p>');

};
if(random==4){
    idid = 75;
  $(".dislike").html('Nakamura TD Daiskyさんの性格はA?B?<br>');
  answer = 1;
  $(".AA").html('<div class="r"><p>人見知りなところがあり、初対面の人と話すことが苦手ですが、人柄が良いのですぐに打ち解けることができるでしょう。</br>純真な心の持ち主で、情にもろいところがあるので騙されないように気を付けましょう。</br>自分の欠点を素直に認め、努力して改善できる人です。</br>でも、好き嫌いはハッキリしており、束縛が大嫌い。</br>器用なので、何事もそつなくこなしますが、気ままで飽きるのが早いところが欠点。</br>機嫌の良い時と、悪い時のギャップが激しいので気を付けましょう。</br></p>');
  $(".BB").html('<div class="r"><p>思ったことをすぐに行動に移すことができる人。</br>動作がキビキビしていて、実行力があるので、仕事では高い評価を受けることができます。</br>勝気でストレートな表現をするため、敵を作りやすい面がありますが、自分の支援者獲得のための努力を怠らないので、味方も多く作ることができるでしょう。</br>頭が良く行動力もありますが、長期戦に弱く楽観的になりすぎる傾向があるので、計画的に行動することが大切です。</br></p>');

};
if(random==4){
    idid = 79;
  $(".dislike").html('今林さんの性格はA?B?<br>');
  answer = 2;
  $(".AA").html('<div class="r"><p>常に受け身の姿勢で人に接することができ、愛嬌があるので、誰からも好感を持たれるタイプです。</br>相手の期待に応えようと頑張るところがあり、自分の感情を抑え疲れてしまうことも。</br>でも、本来は束縛が嫌いで、自由きままに生きていきたいと思っている。</br>縁の下の力持ち的存在で、仕事をきちんとこなす堅実な人。</br>コツコツと努力を続けることができるので、その努力が買われ、いつのまにか出世していたなんてことも。</br></p>');
  $(".BB").html('<div class="r"><p>押しが強く、常に堂々としている人。</br>誰に対しても分けへだてなく接し、上下関係なども気にせずにハッキリと率直な意見が言えます。</br>こびたり、甘えたり、八つ当たりもしない、穏やかでざっくばらんな性格ですが、知的なものを感じさせるので、堅苦しく気どった印象を持たれがち。</br>自分の考えには確固たる自信を持っているので、周りから見ると「意地っ張りな人」と思われることも。</br>しかし、付き合っていくうちにあなたのまじめで正直な性格が伝わり、周りから頼りにされるようになるので大丈夫です。</br>経験から学んだことを未来にいかすことができるので、着実に理想を現実していける人。</br></p>');

};
if(random==5){
    idid = 84;
  $(".dislike").html('岩崎ブライアンさんの性格はA?B?<br>');
  answer = 1;
  $(".AA").html('<div class="r"><p>マイペースで温和な雰囲気を持った人。</br>どんな人にも誠心誠意尽くして接することができ、困っている人たちに手を差し伸べる思いやりを持っています。</br>人の面倒見は良いが、命令されたり指示されることが大嫌い。</br>生まれつき独立運を持っているので、人の上にたつことで成功をおさめることができるでしょう。</br></p>');
  $(".BB").html('<div class="r"><p>裏表のない性格で甘え上手。</br>初対面の人に対しては、あまり心を開かずに、じっくり観察して様子を見ていますが、親しくなるとどんどん踏み込んでいってしまうことも。</br>嘘をつくことが嫌いで、自分に対しても嘘をつかれると冷たい態度をとってしまう傾向があります。</br>もちろんいけないことではありますが、許せる程度の嘘であれば、少し寛大な心を持って許してあげることも時には必要です。</br></p>');

};
if(random==6){
    idid = 94;
  $(".dislike").html('松尾さんの性格はA?B?<br>');
  answer = 2;
  $(".AA").html('<div class="r"><p>温厚な性格と芯の強さを併せ持った人。</br>他の人からの言葉に耳をかさないという、強情な一面もあります。</br>直観力に優れていて、機転が利くので、どんな環境にもうまく適応していけます。</br>しかし、知的に分析することはやや苦手なようです。</br>完璧主義なところがあるので、理想と現実のギャップに悩まされることも多いですが、実力は備わっているので、もっと自分に自信を持つことでより良い方向へ進んでいけるでしょう。</br></p>');
  $(".BB").html('<div class="r"><p>近寄りがたさを感じさせる反面、気安さも感じさせる不思議な雰囲気を持っている人。</br>感受性が豊かで、想像力に富んだ強烈な個性の持ち主。</br>普段は明るく活発だが、気分にむらが多いところがある。</br>また、神経質で飽きっぽいところがあるので、長続きしないことが多い。</br>しかし、社交面での失敗は少ない方。</br>相手を気づかうことができ、意識的におおらかな態度で接することができるからでしょう。</br>物事をとことん突っ込んで分析し、先読みする力に優れているが、最後の詰めは甘いところがウィークポイント。</br>幅広い知識とひらめき力をいかして、素晴らしい力を発揮するタイプと、横道にそれてしまうタイプに2分される。</br></p>');

};
if(random==7){
    idid = 103;
  $(".dislike").html('神山蘭子さんの性格はA?B?<br>');
  answer = 1;
  $(".AA").html('<div class="r"><p>面倒見が良く、穏やかな人なので、同性からも異性からも人気が高い。</br>交友関係が広く、特に年上の人から可愛がられることでしょう。</br>頭の回転が早く、目標に向かって進んでいくパワーがあるが、周りのことが見えなくなってしまうところがあるので気をつけましょう。</br>自分から動くより、人から動かされたほうが運気が上昇します。</br>受身体制が成功へのきっかけとなるでしょう。</br></p>');
  $(".BB").html('<div class="r"><p>周りのことをよく見ていて、人との付き合いが上手な人。</br>人の気持ちを察知する能力に長けていて、人間関係の潤滑油的な存在です。</br>しかし、子供っぽいところもあり、自分がしてあげたことと同等のことを、自分にも返してほしいというわがままな面もあったりします。</br>おっとりしていて、人当たりの柔らかい社交性を発揮し、世の中をうまく渡っていくことができるタイプです。</br></p>');

};
if(random==8){
    idid =2;
  $(".dislike").html('川邉さんの性格はA?B?<br>');
  answer = 2;
  $(".AA").html('<div class="r"><p>負けず嫌いですが、気さくで人当たりもソフトな人。</br>しかし、感情の起伏が激しかったり、好き嫌いが激しいところがあるので、理想と現実のギャップに悩むことがあるかもしれません。</br>感情のムラを表に出さないよう注意が必要です。</br>何事も熱心に取り組み、情報収集力があるので、知識が豊富な人として一目おかれることでしょう。</br>抜群の説得力があり、新しいことに挑戦する行動力も持ち合わせた人です。</br></p>');
  $(".BB").html('<div class="r"><p>男女共に誠実で優しい人です。</br>人見知りせず、行動力もあるため、周りから頼りにされることが多いでしょう。</br>「今日の仕事は今日のうちに」がモットーで、仕事に打ち込んだり、決して妥協しないプロ魂を持っています。</br>甘えや人への依存がなく、束縛を嫌うので、人付き合いはあっさりしています。</br>自分に自信があり、人の意見を軽視する傾向があります。</br>人の意見を聞くことも大切だと自覚することで、より良い関係が築けるでしょう。</br></p>');

};
if(random==9){
    idid = 60;
  $(".dislike").html('三嶋さんの性格はA?B?<br>');
  answer = 1;
  $(".AA").html('<div class="r"><p>いつも客観的で落ちついている人。</br>さらに、器用で多才、強烈な個性を持っているのでミステリアスな印象を与える人。</br>かたよった考え方をせず、利害や人情に左右されませんが、ナイーブな神経の持ち主なので対人関係は苦手なほう。</br>特に、男性の場合は内に秘めた情熱を表に出さないため、冷たい人だと思われてしまうことがあるので注意。</br>時間はかかるけれど、自分の信念を曲げずに上手く個性がいかせれば、驚くようなパワーを発揮するでしょう。</br>確実に結果を出すので、周りからの信頼は高く、安心して仕事を任せられるタイプ。</br>合理的・客観的な考え方ができる人なので、ムダの無い選択をし、充実した生活を送ることができる人。</br></p>');
  $(".BB").html('<div class="r"><p>愛想が良く嫌なことがあっても顔に出さないタイプです。</br>常にニコニコしていて温和な印象があるので、目上の人からも可愛がられることでしょう。</br>しかし、人を見る目は鋭く、好き嫌いがはっきりとしています。</br>おとなしい一面もある一方、気性が激しいところもあるので注意が必要です。</br></p>');

};
if(random==9){
    idid = 82;
  $(".dislike").html('櫨元さんの性格はA?B?<br>');
  answer = 2;
  $(".AA").html('<div class="r"><p>荒々しく豪快な人。</br>男性はそれが行動力のある人、女性は男勝りな人という印象を与えるでしょう。</br>勤勉で怠け者が嫌いな努力至上主義者。</br>妥協を知らないので、「この人にはついていけない」と思われてしまうこともあるので要注意。</br>ただ、頼ってくる人のことは、とことん面倒を見てあげる親分肌なところも。</br>弱音を吐かないので、挫折した時のショックは大きい。</br>妥協も駆け引きもしないところが、最終的には多くの人に認められるでしょう。</br></p>');
  $(".BB").html('<div class="r"><p>負けず嫌いですが、気さくで人当たりもソフトな人。</br>しかし、感情の起伏が激しかったり、好き嫌いが激しいところがあるので、理想と現実のギャップに悩むことがあるかもしれません。</br>感情のムラを表に出さないよう注意が必要です。</br>何事も熱心に取り組み、情報収集力があるので、知識が豊富な人として一目おかれることでしょう。</br>抜群の説得力があり、新しいことに挑戦する行動力も持ち合わせた人です。</br></p>');

};
if(random==9){
    idid = 90;
  $(".dislike").html('青木洋輔さんの性格はA?B?<br>');
  answer = 1;
  $(".AA").html('<div class="r"><p>卑怯なことが大嫌いで、竹を割ったような性格。</br>情にもろく同情しやすいところがあるので、人の世話まで背負い込んでしまうお人好しが多い。</br>かけ引きが下手で、要領よくふるまうことができない不器用さがあるが、それがあなたの魅力でもあります。</br>責任感が強く、理想に走りやすいため、自分の意見をなかなか引っ込めない頑固なところがある。</br>敵視する相手には平気で皮肉を言ってしまうことも。</br>順応性・応用力・行動力に恵まれ、スピーディーな行動で人々の尊敬を集め、無意識のうちになぜか中心的人物になる人。</br>逆境に強く、目標に向かって突き進む意欲も持っているが、厚い壁にぶつかって身動きが取れなくなると自暴自棄になることも。</br></p>');
  $(".BB").html('<div class="r"><p>礼儀正しく、落ち着いた印象を持った人です。</br>物事を冷静に考え、軽はずみな行動をしないので、ミスも少ない。</br>口数が少ないのでクールな感じに見えるようですが、人のためにつくすことができるので、周りからの信頼も自然と集まってくることでしょう。</br>自己中心的な面があり、自分の思い通りにならないと怒りだしてしまうことも。</br>その短気なところが、仕事やプライベートで障害になる可能性があるので注意です。</br></p>');

};
if(random==10){
    idid = 126;
  $(".dislike").html('児玉さんの性格はA?B?<br>');
  answer = 2;
  $(".AA").html('<div class="r"><p>思いやりがあり、人のもめごとを仲裁したり、その場をなごませることができるタイプです。</br>決断力があり、すぐに行動できるので、上手に世の中を渡っていくことができます。</br>あなたからにじみ出ているやさしさが周りの人をほっとさせ、多くの人から慕われることでしょう。</br>おっとりしているように見えますが、実は内には燃えるような熱い思いがあり、目標に向かって苦労をしても立派にやり遂げる根性があります。</br></p>');
  $(".BB").html('<div class="r"><p>押しが強く、常に堂々としている人。</br>誰に対しても分けへだてなく接し、上下関係なども気にせずにハッキリと率直な意見が言えます。</br>こびたり、甘えたり、八つ当たりもしない、穏やかでざっくばらんな性格ですが、知的なものを感じさせるので、堅苦しく気どった印象を持たれがち。</br>自分の考えには確固たる自信を持っているので、周りから見ると「意地っ張りな人」と思われることも。</br>しかし、付き合っていくうちにあなたのまじめで正直な性格が伝わり、周りから頼りにされるようになるので大丈夫です。</br>経験から学んだことを未来にいかすことができるので、着実に理想を現実していける人。</br></p>');

};
if(random==11){
    idid = 96;
  $(".dislike").html('窪田さんの性格はA?B?<br>');
  answer = 1;
  $(".AA").html('<div class="r"><p>意地とプライドを持っていますが、実は寂しがり屋さん。</br>ゆったりとした雰囲気を持っており、ゆるやかな人生を送るでしょう。</br>控えめなわりにはプライドが高いので、人から無理やり与えられたことには拒否反応を示す。</br>しかし、相手に合わせた付き合いもある程度できるので、そのあたりの調整がうまくできると良い人間関係を築けるでしょう。</br>人から相談を受けるのが好きで、人間関係に偏りがない。</br>ただし、本人の愚痴も多め。</br>熱しやすく冷めやすいので、なかなか本心を人に見せないため、異性からは思わせぶりだと思われることも。</br>積極性に欠けるところがあるが、人の心理を見抜く力や客観的な判断力を活かすことで成功をつかむでしょう。</br></p>');
  $(".BB").html('<div class="r"><p>おっとりしているが、自分の信じている物以外には、心を動かされない強い信念の持ち主。</br>権威を重んじ、常識や秩序を乱されることが大嫌い。</br>困ったときでも他人を当てにせず、自力でなんとかしようと努力する人。</br>行動範囲が広く、知的だが、周囲の状況がつい気になり、おせっかいを焼いてしまうところがある。</br>しかし、プライドが高いので、ちょっとでも自分を否定されると傷ついてしまう。</br>直感やインスピレーションで動くタイプではなく、あらゆるデータをもとに考える堅実で博学なタイプ。</br>決して平穏無事な人生ではないが、生来のエネルギーと強運で何事も乗り越えていける人でしょう。</br></p>');

};
if(random==12){
    idid = 99;
  $(".dislike").html('宮澤さんの性格はA?B?<br>');
  answer = 2;
  $(".AA").html('<div class="r"><p>細かいことには無頓着で、明るくのびのびとした性格の人です。</br>面倒見が良いということは良い点であるのですが、頼まれると断れないというお人よしの一面も。</br>強い信念と高いプライドの持ち主なので、負けず嫌いで常にリードしたいタイプ。</br>物事に白黒つけたり、即断するのは苦手。</br>芸術的なセンスに長けていて、独自のセンスや発想を生かすことのできる仕事が天職。</br></p>');
  $(".BB").html('<div class="r"><p>決して弱音をはかない強さがあり、自分にも他人にも厳しい人。</br>一見社交家に見えるが、本来の姿は孤独を恐れず、自分の運命は自分で切り開く独立心の持ち主。</br>負けず嫌いで忍耐強いので、まわりの助けをあてにせず、自分の面倒は自分で見るという強い気持ちがあります。</br>教え方は厳しいものの、相手の細かいところまで気が付くので、指導力は抜群。</br>厳しさに耐えられる相手だったら、素晴らしい師弟関係を結べるはず。</br></p>');

};

};

